<template>
  <Analyze
    :dataPie="dataPie"
    :dataBar="dataBar"
    :dataAll="dataAll"
    :dataCompare="dataCompare"
    :dataTrend="dataTrend"
  />
</template>

<script>
import Analyze from "../../components/analyze";

export default {
  name: "information-analyze",
  data() {
    return {
      dataPie: {
        title: "本月数据统计",
        legend: ["案件", "人员", "情报"],
        data: [
          { value: 335, name: "案件" },
          { value: 310, name: "人员" },
          { value: 234, name: "情报" }
        ]
      },
      dataBar: {
        title: "本月研判统计",
        subhead: "本月研判总人数",
        xAxis: [
          "2019-05-01",
          "2019-05-02",
          "2019-05-03",
          "2019-05-04",
          "2019-05-05",
          "2019-05-06",
          "2019-05-07",
          "2019-05-08",
          "2019-05-09",
          "2019-05-10",
          "2019-05-11",
          "2019-05-12",
          "2019-05-13",
          "2019-05-14",
          "2019-05-15",
          "2019-05-16",
          "2019-05-17",
          "2019-05-18",
          "2019-05-19",
          "2019-05-20",
          "2019-05-21",
          "2019-05-22",
          "2019-05-23",
          "2019-05-24",
          "2019-05-25",
          "2019-05-26",
          "2019-05-27",
          "2019-05-28",
          "2019-05-29",
          "2019-05-30",
          "2019-05-31"
        ],
        data: [
          122,
          124,
          156,
          90,
          123,
          145,
          167,
          189,
          200,
          124,
          122,
          124,
          156,
          90,
          123,
          145,
          167,
          189,
          200,
          124,
          122,
          124,
          156,
          90,
          123,
          145,
          167,
          189,
          200,
          124,
          214
        ]
      },
      dataAll: [
        {
          name: "案件",
          value: "2233"
        },
        {
          name: "人员",
          value: "2233"
        },
        {
          name: "情报",
          value: "2233"
        }
      ],
      dataCompare: {
        title: "本年数据比较",
        legend: ["案件", "人员", "情报"],
        xAxis: [
          "一月",
          "二月",
          "三月",
          "四月",
          "五月",
          "六月",
          "七月",
          "八月",
          "九月",
          "十月",
          "十一月",
          "十二月"
        ],
        data: [
          {
            name: "案件",
            value: [320, 332, 301, 334, 390, 330, 320, 320, 332, 301, 334, 390]
          },
          {
            name: "人员",
            value: [120, 132, 101, 134, 90, 230, 210, 120, 132, 101, 134, 90]
          },
          {
            name: "情报",
            value: [220, 182, 191, 234, 290, 330, 310, 220, 182, 191, 234, 290]
          }
        ]
      },
      dataTrend: {
        title: "本年数据趋势",
        xAxis: [
          "一月",
          "二月",
          "三月",
          "四月",
          "五月",
          "六月",
          "七月",
          "八月",
          "九月",
          "十月",
          "十一月",
          "十二月"
        ],
        data: {
          name: "数据",
          value: [120, 132, 101, 134, 90, 230, 210, 120, 132, 101, 134, 90]
        }
      }
    };
  },
  components: {
    Analyze
  }
};
</script>

<style lang="stylus" scoped></style>